# GetUpdatingSharedParameters Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarFreeFormAccessor..::..GetUpdatingSharedParameters Method
RebarFreeFormAccessor Class See Also
---
Get the shared parameters listed as dependencies in the calculation of the rebar curves
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public IList<ElementId> GetUpdatingSharedParameters()
```

Visual Basic
---
```text
Public Function GetUpdatingSharedParameters As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetUpdatingSharedParameters()
```

# ### Return Value
Returns the elementIds of the shared parameters
# See Also
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace